[
    {
        "title": "Rural Maternal Care Crisis Preparedness & Readiness",
        "length": "Twelve (12) Weeks",
        "offerings": "",
        "description": "Each of the three-month offerings, speaks to advocacy and formulation of Protocol, Law and access to Maternal Care services in Rural, undeveloped and unserved areas of foreign and domestic lands! We service pregnant and newly birthed women that IDP's Refugees, Asylum Seekers, Stateless, Undocumented and women in recovery from DV/IPV, Substance Abuse, HIV, Birthing through Incest and as a Child Bride and FGM.",
        "pdf": ""
    },
    {
        "title": "I.S.L.A.M.I.C. Leadership and Advocacy\n(Islamic Sister-Leaders And Mentors - Intensive Cohort)",
        "length": "Eight (8) Weeks - on Saturdays",
        "offerings": "March - May\nSeptember - November",
        "description": "This Fellowship offers Muslim Women, leadership skills and resources, to serve their communities. The Fellowship offers the opportunity to advance their talent skills and abilities to access, apply for, and attain the subsidy resources, venture capital and communal support and funding, to continue their benevolence work in their communities.\n\nThis cohort is designed to mentor the needs of the community to bridge the resources that are out in the community waiting to to be accessed.",
        "pdf": "islamic_sister-leaders_and_mentors_intensive_cohort_fellowship_syllabus.pdf"
    },
    {
        "title": "SISTTAR Peer Mental Health Advocacy",
        "length": "Eight (8) Weeks - on Wednesdays",
        "offerings": "January - March\nMay - July\nSeptember - November",
        "description": "This Fellowship allows the leader to challenge themselves and the environment to which they belong. They will be tasked in understanding the triggers, traumas and triumphs of basic Mental Health matters; to be able to recognize a crisis, as well as the warning signs of grooming, vetting and trafficking in IDP, vulnerable and young demographics.\nFellows will be Peer certified in the filed to report findings to local MH Practitioners and Hospitals  in their communities.",
        "pdf": ""
    },
    {
        "title": "Sexual/Gender Based Violence Advocacy",
        "length": "Twelve (12) Weeks - on Tuesdays",
        "offerings": "January - April\nMarch - June\nOctober - January",
        "description": "This Cohort opens the Fellow to the knowledge, understanding and the capacity to offer solutions in their community, to end Sexual and gender-based Violence. We deal with Stranger, Incestral and Date Rape, Sexual, Domestic and Intimate Partner Violence (IPV), Survival Sex, Child Brides/Dowry, Female Genital Mutilation/Birthing through Fistula and much more.",
        "certs": "Cross-Cultural Diversity Inclusion and Sensitivity\nHuman Rights Advocacy",
        "pdf": ""
    },
    {
        "title": "Human Rights in Crisis",
        "length": "Ten (10) Weeks - on Thursdays",
        "offerings": "April - ​June\nMay - July\nSeptember - November",
        "description": "In this Cohort, Fellows will be introduced to the concepts of \"What happens if the program fails?\". They will discover problem solving techniques, the concepts of forming \"Think Tanks\", Ethical Standards in care in crisis, Dealing with Pandemics and the social constructs of Emotional Intelligence (EI), a \"Social Intelligentsia\" (SI), Biopsychosocial Trauma and dismantling the resources we have to formulate a \"Plan B\" to continue our work.",
        "certs": "A Course in Dignity\nImplicit Bias Training",
        "pdf": ""
    },
    {
        "title": "Eff. Social Recruitment in Human Rights Work",
        "length": "Ten (10) Weeks - on Mondays",
        "offerings": "April - July\nSeptember - November",
        "description": "Successful cohorts will begin to unpack the structure of recruitment for your very own Human Rights Agency. No matter the genre or the mission, Human Rights Work has very different, specific and unique predilections to the service you offer with a foundation in compassion and fairness to all. Fellows will learn \"What is Human Rights Recruitment?\" (and the difference in \"hiring\"), The Need for \"leaders\" in Human Rights Work (the autonomy of the work), Finding the unique talent for YOUR industry, the Power of a Mentor an evaluating and rewarding talent...and more",
        "certs": "Cultural Competency in Human Rights\nRelationship Building in Human Rights Leadership",
        "pdf": ""
    },
    {
        "title": "Human Rights & Gender-based Grant Funding",
        "length": "​Eight (8) Weeks - on Saturdays",
        "offerings": "​February - May\nOctober - December",
        "description": "VC's and Grants and Funding...O' My! Fellows will be offered breakdown of Grants, Loans, subsidies, liquid resources, financial endorsements, hosting and more and the best way to market your product, to be able to sell your digital and personal services in Human Rights. Fellows will get insider tricks to getting a feasibility statement done, knowing the power of your Brand, getting Board Members of a Board of Trustees and how funders to look at your organization. Cohorts will even learn how to write your first resource manual, extended project overview or your first eBook for profit.",
        "pdf": ""
    },
    {
        "title": "Self Care and the Selfless Humanitarian",
        "length": "Eight (8) Weeks - on Tuesdays",
        "offerings": "January - March\n​October - December",
        "description": "For those that give and keep on giving all year, here is the best solution to learning how to \"receive\". This Fellowship is all about YOU, the servant! From learning your Why, to unpacking years of frustration at where you are in life, to learning a new way to destress, this is designed to allow YOU to be seen, respected and dignified with a \"YES\" to loving you!\n\nThis course is open as a \"Train the Trainer\" modality in its offering; successful Fellows will be able to teach this at the peer level to be able to offer this work within their Human Rights Practice.",
        "pdf": ""
    },
    {
        "title": "Ancestry Quest: Unraveling Genetic Origins",
        "length": "12 Weeks - on Saturdays",
        "future": "2024",
        "offerings": "January - March\nMay - July",
        "description": "They ask you , \"Where are you from\" you answer them giving them the area you are familiar with or even where you were born. But have you ever asked yourself that question? Harbor Heritage University will help you find that answer and celebrate your ancestry and the place  that is your true \"home\". You will discover the difference between Legacy, Heritage, Ancestry and the lineage you hold. You will take a walk through Ancestral Tradition, Domestic Culture and  the \"ways\" you have discovered in the life you live. Your graduation will be your Ancestral Reveal and will be welcomed by your new Tribe and People.",
        "pdf": "hhu_diplomatic_fellowship_syllabus__ancestry_quest_.pdf"
    },
    {
        "title": "Gender-Responsive Restorative Justice",
        "length": "Eight (8) Weeks - on Mondays",
        "future": "2024",
        "offerings": "",
        "description": "This Gender-Responsive Restorative Justice Fellowship is an introduction to the work done at the ~Lalo College of Gender-Responsive Restorative Justice~. It will combine the orchestration of the communal needs and the inclusive, trauma-information work of the Fellow. This Biopsychosocial environmental effect of blending Critical thinking in with Emotional Intelligence will surely forge and outcome that is both smart and generationally sustainable.",
        "pdf": "gender_responsive_restorative_justice_fellowship_syllabus_.pdf"
    },
    {
        "title": "BIPOC Maternal Health Disparities",
        "length": "Eight (8) Weeks -  on Tuesdays",
        "future": "2024",
        "offerings": "",
        "description": "This is a Domestic and International comparative look at the current plans, policies and programs that WORK for birthing women in the BIPOC communities and those historically disadvantaged in in rural and underdeveloped areas of the world. It will tackle, dialect Inclusion, cultural access,  Naturopathic and Allopathic comparative and the Reproductive injustices that are seen but not corrected in society.",
        "pdf": "bipoc_maternal_health_disparities_fellowship_syllabus_.pdf"
    },
    {
        "title": "BIPOC Civil Engagement and our Voting Rights",
        "length": "Eight (8) Weeks - On Wednesdays",
        "future": "2024",
        "offerings": "",
        "description": "Ever wonder why congress is still having to 'extend' voting rights for the BIPOC communities? Ever ask yourself why you are not told why this continues to happen? And why was it written this way? Lets look at the pathology that led to this and then lets use our talents, gifts, abilities...AND RIGHTS, to see this 'practice' end, in our lifetime!",
        "pdf": "bipoc_civil_engagement_and_voting_rights_fellowship_syllabus.pdf"
    },
    {
        "title": "BIPOC Economic Equity and Inequality",
        "length": "Eight (8) weeks - on Thursdays",
        "future": "2024",
        "offerings": "",
        "description": "Are you good with a budget? Or are you interested in creating one to improve your community? Lets delve into the common reasons that separate Finances and Economy and then how to mesh the two together to form a \"more perfect union\" monetarily, within our communities.",
        "pdf": "bipoc_economic_equity_and_inequality_fellowship_syllabus.pdf"
    },
    {
        "title": "BIPOC Systematic vs. Systemic Disparities",
        "length": "Eight (8) weeks - on Saturdays",
        "future": "2024",
        "offerings": "",
        "description": "It would take much longer than eight (8) weeks to uncover and promote the best way to verbalize this daunting disparity in communities of color, but this Fellowship is designed to open the conversation, set the tone and then discover (and rediscovery) the many ports of intentional discrimination in the country. We will begin with the thought processes and then continue to the resulting 'delinquencies' that face historically disadvantaged communities. There will certainly be a 'part 2' to this Fellowship!",
        "pdf": "bipoc_systematic_vs_systemic_disparities_fellowship_syllabus.pdf"
    },
    {
        "title": "BIPOC Dehumanization Deconstruction Plan",
        "length": "Eight (8) weeks - on Mondays",
        "future": "2024",
        "offerings": "",
        "description": "Taking another look at the theory of \"All men are created equal\" and why this only applies to 'certain' men. Why is that we have the 'right to life, liberty and the PURSUIT of happiness'? Where is it written that a certain people get to have it all and certain people get the 'ideal' of that notion? Who chooses that and why was that community chosen to 'draw the short straw'? Lets look at societal dehumanization as \"depersonalization.\" Depersonalization refers to the process by which individuals or groups are stripped of their individuality, humanity, or personal characteristics, often leading to the perception of them as mere objects or stereotypes rather than fully developed human beings.",
        "pdf": "bipoc_dehumanization_deconstruction_plan_syllabus.pdf"
    },
    {
        "title": "Community Health reDevelopment Programs for Rural Areas",
        "length": "Eight (8) weeks - on Tuesdays",
        "future": "2024",
        "offerings": "",
        "description": "Opening with Cultural Competencies, advancing to reshaping Public Health Policy and delving deep into social plans of Crisis Response and Generational Resilience, we will topple eight (8) weeks of knowing and growing in making better health decision for our family and community while building the table of Inclusive Health Care (IHC) Programming that we are setting our sights to build. ",
        "pdf": "community_health_redevelopment_programs_for_rural_areas_fellowhip_syllabus.pdf"
    },
    {
        "title": "The Orphaned, Surrendered, Migrant and Indigenous Child",
        "length": "Eight (8) weeks - on Wednesdays",
        "future": "2024",
        "offerings": "",
        "description": "Building on Crisis Response and Generational Resilience, lets begin to look at the Orphaned, the Surrendered, the Migrant and the Indigenous child and what the current system has set up for them in life. We will look at Child Protective Services, The Foster Care and Social Service Systems and if opening new Emotionally Intelligent ResiSchool (Residential School) Centers will offer a bit more security and stabilities for the children, as they navigate life, unparented.",
        "pdf": "orphaned_surrendered_migrant_and_indigenous_child_fellowhip_syllabus.pdf"
    },
    {
        "title": "Trauma Informed Reintegration of the Formerly Incarcerated",
        "length": "Eight (8) weeks - on Thursdays",
        "future": "2024",
        "offerings": "",
        "description": "Lets look at the difference in the way people are incarcerated in the the US and Canada and compare that to those incarcerated in the Scandinavian Countries. Lets then lens human conviction on the human convict. Lets see if more palliative, restorative ways of fixing what is broken in those incarceration will fetter a greater human upon returning to society.",
        "pdf": "trauma_informed_reintegration_of_the_formerly_incarcerated_fellowhip_syllabus.pdf"
    },
    {
        "title": "Moral Injury Counseling: A new way to fix accountability in humans",
        "length": "Eight (8) Weeks - Saturdays",
        "future": "2024",
        "offerings": "",
        "description": "What does Sexual and Gender-based Violence and Trauma have to do with Faith and Spirituality...or even Intersectionality and Identity, for that matter? Do they pertain? Should they even mix? Is there a way to counsel Forgiveness and Healing and manner a way of moving forward, in advocacy and support after the storm? We will look at a new term of \"Emotional Reparations\" in Accountability as a Survivor -Centered Care Plan, in their rise to victory.",
        "pdf": "moral_injury_counseling_fellowhip_syllabus.pdf"
    },
    {
        "title": "Biopsychosocial Ecology and Environmental Disparities",
        "length": "Eight (8) Weeks - Mondays",
        "future": "2024",
        "offerings": "",
        "description": "DESCRIPTOR",
        "pdf": ""
    }
]